
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    import {str} from '@lit/localize';

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hcf737b9b198de693': html`Μπορείτε επίσης να απενεργοποιήσετε προσωρινά το snapping πατώντας
          <sl-tag size="small">Alt
          </sl-tag> ενώ σέρνετε ένα στοιχείο
        `,
's109991b0423f1512': `Βιολέτα`,
's202fffd5a2e1c595': `Μήκος`,
's24d82e0bdc4ea31f': `Εμφάνιση περιμέτρου`,
's2706a162264c46f1': `Κλίμακα`,
's2dae9bc7aa02bab7': `Κλιμακώνει όλες τις ετικέτες μήκους και μεγέθους.`,
's3b627b7632baa8d7': `Δημιουργία διαχωριστικών γραμμών`,
's3d0296b47fe6323c': `Ασβέστης`,
's447b301ca02b353e': `Περίμετρος: `,
's44f0e16cc86358e2': `Χρώμα σημείου`,
's4585ad5504d24a6b': `Διαγραφή επιλεγμένων αντικειμένων`,
's4fd35ef13079b962': `Αφηρημένη ορθή γωνία`,
's5246434aaa760348': `Ετικέτα σχήματος`,
's5cda68f59fd34ebf': `Πλάτος γραμμής`,
's5e3cb80d43a34044': `Μαύρο`,
's6751f51ab77310e5': `Περιοχή προβολής`,
's6baf78886c99db89': `Κίτρινο`,
's71f4a89a7cd714ee': `Περιοχή: `,
's73c0e4814878d26e': `Σύγκλιση σε πλέγμα`,
's8a347fce9c8f6045': `Επιλογή και μετακίνηση αντικειμένων`,
's8f450dd0b7bdb8cb': `Πορτοκαλί`,
's997f2252dabae00f': `Χρώμα πλήρωσης`,
's9b3c2f9cc32d565a': `Κυανό`,
's9ff1de19feac1b7c': `Κόκκινο`,
'sb6055dddb583f562': str`
          ${0} επιλεγμένα αντικείμενα
        `,
'sbaf7984effccc73d': `Ετικέτα γραμμής`,
'sc641744471095036': `Χρώμα ετικέτας`,
'sc76449099e8dab8e': `Δημιουργία και σύνδεση αντικειμένων`,
'scf00d78fd5953f1c': `Πράσινο`,
'sd0e945b97c0c46d1': `Διαφανές`,
'se9beed19c6a38fed': `Ροζ`,
'secf3d3a7c1693e2d': `Μπλε`,
'sf6f1d2fce4cc2014': `Εμφάνιση πλέγματος`,
'sf8f55cf0946dcb38': `Χρώμα γραμμής`,
'sf9f816447b409e1c': `Όταν είναι ενεργοποιημένη, οι ορθές γωνίες θα σχεδιάζονται ως ένα μικρό τετράγωνο`,
    };
  