
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    import {str} from '@lit/localize';

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hcf737b9b198de693': html`Вы также можете временно отключить привязку, нажав
          <sl-tag size="small">Alt
          </sl-tag> во время перетаскивания элемента
        `,
's109991b0423f1512': `Виолетта`,
's202fffd5a2e1c595': `Длина`,
's24d82e0bdc4ea31f': `Показать периметр`,
's2706a162264c46f1': `Масштаб`,
's2dae9bc7aa02bab7': `Масштабирует все этикетки по длине и размерам.`,
's3b627b7632baa8d7': `Создание разделительных линий`,
's3d0296b47fe6323c': `Лайм`,
's447b301ca02b353e': `Периметр: `,
's44f0e16cc86358e2': `Цвет точки`,
's4585ad5504d24a6b': `Удаление выбранных объектов`,
's4fd35ef13079b962': `Абстрактный прямой угол`,
's5246434aaa760348': `Этикетка формы`,
's5cda68f59fd34ebf': `Ширина линии`,
's5e3cb80d43a34044': `Черный`,
's6751f51ab77310e5': `Область показа`,
's6baf78886c99db89': `Желтый`,
's71f4a89a7cd714ee': `Область: `,
's73c0e4814878d26e': `Привязка к сетке`,
's8a347fce9c8f6045': `Выбирайте и перемещайте объекты`,
's8f450dd0b7bdb8cb': `Оранжевый`,
's997f2252dabae00f': `Цвет заливки`,
's9b3c2f9cc32d565a': `Циан`,
's9ff1de19feac1b7c': `Красный`,
'sb6055dddb583f562': str`
          ${0} выбранные объекты
        `,
'sbaf7984effccc73d': `Этикетка линии`,
'sc641744471095036': `Цвет этикетки`,
'sc76449099e8dab8e': `Создание и соединение объектов`,
'scf00d78fd5953f1c': `Зеленый`,
'sd0e945b97c0c46d1': `Прозрачный`,
'se9beed19c6a38fed': `Розовый`,
'secf3d3a7c1693e2d': `Голубой`,
'sf6f1d2fce4cc2014': `Показать сетку`,
'sf8f55cf0946dcb38': `Цвет линии`,
'sf9f816447b409e1c': `Если включить эту функцию, прямые углы будут нарисованы в виде маленького квадрата`,
    };
  