
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    import {str} from '@lit/localize';

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'hcf737b9b198de693': html`Ви також можете тимчасово вимкнути прив'язку, натиснувши
          <sl-tag size="small">Alt
          </sl-tag> під час перетягування елемента
        `,
's109991b0423f1512': `Фіалка.`,
's202fffd5a2e1c595': `Довжина`,
's24d82e0bdc4ea31f': `Показати периметр`,
's2706a162264c46f1': `Масштаб`,
's2dae9bc7aa02bab7': `Масштабує всі етикетки довжин і розмірів.`,
's3b627b7632baa8d7': `Створіть розділові лінії`,
's3d0296b47fe6323c': `Вапно.`,
's447b301ca02b353e': `Периметр: `,
's44f0e16cc86358e2': `Колір точки`,
's4585ad5504d24a6b': `Видалення вибраних об'єктів`,
's4fd35ef13079b962': `Абстрактний прямий кут`,
's5246434aaa760348': `Фігурна етикетка`,
's5cda68f59fd34ebf': `Ширина рядка`,
's5e3cb80d43a34044': `Чорний.`,
's6751f51ab77310e5': `Показати область`,
's6baf78886c99db89': `Жовтий`,
's71f4a89a7cd714ee': `Територія: `,
's73c0e4814878d26e': `Прив'язати до сітки`,
's8a347fce9c8f6045': `Виділення та переміщення об'єктів`,
's8f450dd0b7bdb8cb': `Помаранчевий`,
's997f2252dabae00f': `Колір заливки`,
's9b3c2f9cc32d565a': `Блакитний`,
's9ff1de19feac1b7c': `Червоний`,
'sb6055dddb583f562': str`
          ${0} вибрано об'єктів
        `,
'sbaf7984effccc73d': `Мітка рядка`,
'sc641744471095036': `Колір етикетки`,
'sc76449099e8dab8e': `Створюйте та з'єднуйте об'єкти`,
'scf00d78fd5953f1c': `Зелений`,
'sd0e945b97c0c46d1': `Прозорий`,
'se9beed19c6a38fed': `Рожевий.`,
'secf3d3a7c1693e2d': `Синій`,
'sf6f1d2fce4cc2014': `Показати сітку`,
'sf8f55cf0946dcb38': `Колір лінії`,
'sf9f816447b409e1c': `Якщо увімкнено, прямі кути будуть намальовані у вигляді маленького квадратика`,
    };
  